tsung_workflows/authenticated_user_login_create_delete_tweets.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/opt/homebrew/Cellar/tsung/1.7.0/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice">
  <clients>
    <client host="localhost" maxusers="32768" use_controller_vm="true" />
  </clients>

  <servers>
    <!-- <server host="localhost" port="3000" type="tcp"></server> -->
     <server host="wf3opt-np1.eba-mpffqwyy.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
    <!-- <server host="nikunjbaid1.eba-mpffqwyy.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server> -->
  </servers>

  <load>
    <arrivalphase phase="1" duration="5" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="2" duration="5" unit="second">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="3" duration="5" unit="second">
      <users arrivalrate="4" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="4" duration="5" unit="second">
      <users arrivalrate="8" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="5" duration="5" unit="second">
      <users arrivalrate="16" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="6" duration="5" unit="second">
      <users arrivalrate="32" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="7" duration="5" unit="second">
      <users arrivalrate="64" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="8" duration="5" unit="second">
      <users arrivalrate="128" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="9" duration="5" unit="second">
      <users arrivalrate="256" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="10" duration="5" unit="second">
      <users arrivalrate="512" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="300000"></option>
  </options>
  
  <sessions>    
    <session name="user_login_tweets_deletes" type="ts_http" weight="1">     

      <transaction name="login">
        
        <setdynvars sourcetype="random_number" start="1" end="11000">
          <var name="randomNum" />
        </setdynvars>

        <request>
          <dyn_variable name="authenticity_token"></dyn_variable>
          <http method="GET" url="/users/sign_in"></http>
        </request>
        <thinktime value='1' random='true'/>

        <setdynvars code='fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,"[+]","%2B",[global,{return,list}]) end.' sourcetype="eval"> 
          <var name="authenticity_token" /> 
        </setdynvars>
        
        <request subst="true">
          <http url="/users/sign_in" version="1.1" method="POST"
            contents="user[email]=a@a.com&amp;authenticity_token=%%_authenticity_token%%&amp;
                      user[password]=qweqwe&amp;commit=Log+in"
            content_type="application/x-www-form-urlencoded">
          </http>
        </request>  

        <request subst="true">
          <http url="/tweets" method="POST"
            contents="authenticity_token=%%_authenticity_token%%&amp;tweet[content]=Hello Dood&amp;
                      commit=Create Tweet&amp;tweet[likes]=0&amp;tweet[comments]=0"
            content_type="application/x-www-form-urlencoded">
          </http>
        </request> 

        <request subst="true">
          <http url="/comments" method="POST"
            contents="authenticity_token=%%_authenticity_token%%&amp;
                      comment[user_id]=1&amp;
                      comment[tweet_id]=%%_randomNum%%&amp;
                      comment[content]=Yo Dood&amp;
                      commit=Add Comment"
            content_type="application/x-www-form-urlencoded">
          </http>
        </request>

        <request><http method="GET" url="/tweets"></http></request>
        <thinktime value='2'/>

        <request subst="true">
          <http url="/tweets/%%_randomNum%%" method="DELETE"
            contents="authenticity_token=%%_authenticity_token%%">
          </http>
        </request>        
        
      </transaction>
    </session>
  </sessions>
</tsung>