tsung_workflows/authenticated_user_login_create_delete_tweets.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/opt/homebrew/Cellar/tsung/1.7.0/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice">
  <clients>
    <client host="localhost" maxusers="32768" use_controller_vm="true" />
  </clients>

  <servers>
    <!-- <server host="localhost" port="3000" type="tcp"></server> -->
     <server host="satyam2.eba-mpffqwyy.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
    <!-- <server host="nikunjbaid1.eba-mpffqwyy.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server> -->
  </servers>

  <load>
    <arrivalphase phase="1" duration="5" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="2" duration="5" unit="second">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="3" duration="5" unit="second">
      <users arrivalrate="4" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="4" duration="5" unit="second">
      <users arrivalrate="8" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="5" duration="5" unit="second">
      <users arrivalrate="16" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="6" duration="5" unit="second">
      <users arrivalrate="32" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="7" duration="5" unit="second">
      <users arrivalrate="64" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="8" duration="5" unit="second">
      <users arrivalrate="128" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="9" duration="5" unit="second">
      <users arrivalrate="256" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="10" duration="5" unit="second">
      <users arrivalrate="512" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="300000"></option>
    <option name="file_server" id='userdb' value="/home/ec2-user/userlist.csv"/>
  </options>
  
  <sessions>    
    <session name="user_login_tweets_deletes" type="ts_http" weight="1">     

      <transaction name="login">
        <!-- sets dynamic variables from csv list with id userlist -->
        <setdynvars sourcetype="file" fileid="userdb" delimiter="," order="iter">
          <var name="tweet_cont" />
          <var name="tweet_id" />
        </setdynvars>

        <request>
          <dyn_variable name="authenticity_token"></dyn_variable>
          <http method="GET" url="/users/sign_in"></http>
        </request>

        <thinktime value='1' random='true'/>

        <!-- parses dynamic variables user_email, user_id and authenticity_token to url-encoded variables -->
        <setdynvars code='fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,"[+]","%2B",[global,{return,list}]) end.' sourcetype="eval"> 
          <var name="authenticity_token" /> 
        </setdynvars>
        
        <setdynvars sourcetype="eval"
                    code="fun({Pid,DynVars})->
                              {ok,Val}=ts_dynvars:lookup(tweet_id,DynVars),
                              http_uri:encode(Val) end.">
          <var name="tweet_id" />
        </setdynvars>
        <setdynvars sourcetype="eval"
                    code="fun({Pid,DynVars})->
                              {ok,Val}=ts_dynvars:lookup(tweet_cont,DynVars),
                              http_uri:encode(Val) end.">
          <var name="tweet_cont" />
        </setdynvars>

        <request subst="true">
          <http url="/users/sign_in" version="1.1" method="POST"
            contents="user[email]=a@a.com&amp;authenticity_token=%%_authenticity_token%%&amp;
                      user[password]=qweqwe&amp;commit=Log+in"
            content_type="application/x-www-form-urlencoded">
          </http>
        </request>  

        <thinktime value='1'/>

        <request subst="true">
          <http url="/tweets" method="POST"
            contents="authenticity_token=%%_authenticity_token%%&amp;tweet[content]=%%_tweet_cont%%&amp;
                      commit=Create Tweet&amp;tweet[likes]=0&amp;tweet[comments]=0"
            content_type="application/x-www-form-urlencoded">
          </http>
        </request>
        <thinktime value='1'/>

        <request subst="true">
          <http url="/tweets/%%_tweet_id%%" method="POST"
            contents="authenticity_token=%%_authenticity_token%%&amp;_method=delete"
            content_type="application/x-www-form-urlencoded">
          </http>
        </request>
        
      </transaction>
    </session>
  </sessions>
</tsung>